[
  {
    "path": "posts/2021-11-14-new/",
    "title": "Confocal Microscopy: Maximizing the scope of visualization and imaging in biological science",
    "description": "A short description of the post.",
    "author": [
      {
        "name": "Lalit Kumar Gautam",
        "url": "https://lkg.netlify.app"
      }
    ],
    "date": "2021-11-14",
    "categories": [
      "Microscopy",
      "Fluorescence",
      "Review Article",
      "Imaging"
    ],
    "contents": "\r\nAbstract\r\nThe biological science research has been progressed by the high end characterization of cells or cellular organelles. Development of bio-imaging techniques advanced the research in applied biology. Confocal laser scanning microscopy (CLSM) provide high advantage in the image acquisition as compared to conventional visualization methods, as does not require any addition sample preparation, easy to operate and provides high contrast scanning. CLSM also perform rapid acquisition of images of biological samples in longitudinal and cross-sectional at any position as well in all three dimensions.. Therefore, the CLSM-based image visualization and acquisition provide direct insight into characterizations of surface or intracellular objects. This review summarizes the applications of CLSM for solving the integrity of complex biomolecules and structures. Existing confocal microscopy approaches for the visualization of minute,internal structures of a cell, spatial arrangement of cell or tissues and components of metabolic pathways are discussed in detail. Additionally, prospect and potential of this advanced form of microscopy in the field of in life science in future has been entailed. The motive of this review is to help researchers to choose an appropriate/suitable CLSM approach for characterizations biomolecules and bio structures, and provide an update on recent advancement in the field of confocal microscopy to so that new opportunities can be explored for and inspirations for design of appraoches for preparation of biological samples. We believe that this review would benefit researchers working in the field of biological/life science.\r\nIntroduction\r\nDeconvolution, rotatable reconstructions and 3D, can be generated from the acquired image stack that can be analyzed using the image processing and analysis suites supplied with the Microscope instrument providers and by using ImageJ software (NIH, USA).\r\nHistory\r\nConfocal laser scanning microscopy (CLSM) is one of the most important advancement in the area of fluorescence imaging during recent decades. it is considered as the most essential tool in biological research. CLSM acquires much poorer resolution as compared with electron microscopy, but it does not requires high-end specimen preparation provides advantage of threedimensional (3D) live imaging, help in assessing the dynamic of cellular and molecular bio-processes. CLSM is classified as photonics and imaging technologies. Confocal refers that the image is acquired from the focal plane only, while any noise signals resulting from thickness of sample are optically removed. Laser scanning in CLSM means the images in the focal plane are acquired point to point manner rather than complete illumination of sample under localized laser excitationThe main concept of confocal microscopy was developed by Minsky in the 1950s in the first place (reference). 10 years later,Egger and Petran devised the first scanning confocal laser microscope. Advances in computer and laser technology enabled improvements to the system, and the first commercial instruments became available in 1987. This technology has since become the technique of choice for a new generation of microbiologists interested in microorganisms spatially organized on surfaces, or biofilms. The pioneering work by Bill Costerton and his colleagues clearly demonstrated the structure–function relationships within these biostructures, and notably their extraordinary resistance to antimicrobial agents. Thirty years later, more than 2000 scientific papers each year are deciphering the cellular and molecular processes involved in the biofilm ‘phenotype,’ and most of them incorporate CLSM images. .\r\nDevelopment/advancements\r\nResolutions\r\nLasers\r\nFluorochromes\r\nVisualization\r\nSurface structure\r\nInternal structure\r\nThree dimensional\r\nSpatial-temporal impacts of antimicrobial treatment\r\nReichhardt C and Parsek MR (2019) Confocal Laser Scanning Microscopy for Analysis of Pseudomonas aeruginosa Biofilm Architecture and Matrix Localization. Front. Microbiol. 10:677. doi: 10.3389/fmicb.2019.00677 rechrd et al (2019)\r\nGradual processes\r\nDespite the big advantages of CLSM there are some limitations such asfor dermatological imaging it offers restricted depth of penetration (200-300 μm) (Refe), due to which deeper part of hypodermis cannot be visualized (3,4). using the currently available confocal microscopes. Though these deeper skin strcutures can be imaged using high laser power, but it mar harm the sample/skin area under evalulation/examination (González 2008; Filoni and Alaibac 2019)⁠ (52). Moreover, examinating thef skin lesions with the help of CLSM is more time consuming than dermoscopy or clinical evaluation because it requires intensive training and expertise for correct interpretation of CLSM image aquired from the lesions. Technological advancements have led to the improvement in the microscopic techniques as smaller newer and more practical devices, now allow faster image acquisition which can capture the images of lesions present in least accessible body areas (52)(Gonzaláz 2017)⁠. ICLSM does not require processing, coating, coloring of samples and images can also be obtained in greyscale, similar to other imaging techniques such as X-rays or ultrasonography (Ilie et al. 2019)⁠. however the colouring range/ detection range / limits for the biological samples are wide and offers vaarious choices to the user for detection of flo=uorophores , although efforts to improve contrast and color-enhancment of thicker structures (like epidermal and dermal structures, …..) are being made and new dyes (e.g. indocyanine green) are tested for thie purposes (Skvara et al. 2011)⁠.\r\nFuture perspectives\r\nCLSM has a diverse applications in biological science and offers great potential for investigation of complex features, transitions of orgenelles or any morphological changes happening inside a cell. In this review, a number of approaches has been summarized which have been unitized in recent studies for the CLSM based acquisition and visualization of fiunctional/proteins or morphological changes occoured under specific/specialized condition by the . The approaches had been categoriesd in accordance with particular visual aspects of biological entities, which inclues surface structures, internal structures, spatial structures and reaction processes. Best suited approaches and technique for CLSM could strengthen the implication to gain advantage this advanced form of microscopy. Importnatly, CLSM offer large-scale three-dimensional imaging of biological samples (matrix, celluar lumps, tumors, biofilms, fusion protein etc.. The hassle-free sample preparation potentiates the non-invasive visualization of the samples under CLSM. The imaging is relatively faster in CLSM p rapid description of materials in real time (eg. cell progression/live cell imaging). In order to utilize the potential of latest techniques for the advanced research, sometimes we find some lacuna in advanced yet powerful tools and this is true with CLSM while analyzing biological samples. Major challenges for the use of CLSM are: (1) CLSM should have improved sensitivity to ultra-weak luminescence and faster scanning speed to catch the fast and weak luminescence phenomena; (2) its slowness in reconstructing a three-dimensional image from a set of tomographic image slices is insufficient for in situ kinetics of some processes; (3) although several visualization methods for materials based on CLSM are being standardized by large microscope manufacturing companies and industrial enterprises\r\n\r\n\r\n\r\nReichhardt, Courtney, and Matthew R. Parsek. 2019. “Confocal Laser Scanning Microscopy for Analysis of Pseudomonas Aeruginosa Biofilm Architecture and Matrix Localization” 10 (April). https://doi.org/10.3389/fmicb.2019.00677.\r\n\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2021-11-14T13:07:34+05:30",
    "input_file": "new.knit.md"
  }
]
